Core/src/AccumulationRegisters/НалоговыеЛготы/НалоговыеЛготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НалоговыеЛготы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЛгот</name>
    <type>
      <types>EnumRef.ТипЛгот</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/НалоговыеЛготы/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НалоговыеЛготы.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияНалоговыеЛготыИзменение") ИЛИ
		СтруктураВременныеТаблицы.Свойство("ДвиженияНалоговыеЛготыИзменение") И НЕ СтруктураВременныеТаблицы.ДвиженияЗапасыИзменение Тогда
		
		// Если временная таблица "ДвиженияЗапасыИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НалоговыеЛготы.НомерСтроки КАК НомерСтроки,
		|	НалоговыеЛготы.Организация КАК Организация,
		|	НалоговыеЛготы.Сотрудник КАК Сотрудник,
		|	НалоговыеЛготы.Подразделение КАК Подразделение,
		|	НалоговыеЛготы.ТипЛгот КАК ТипЛгот,
		|	ВЫБОР
		|		КОГДА НалоговыеЛготы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА НалоговыеЛготы.Сумма
		|		ИНАЧЕ -НалоговыеЛготы.Сумма
		|	КОНЕЦ КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияНалоговыеЛготыПередЗаписью
		|ИЗ
		|	РегистрНакопления.НалоговыеЛготы КАК НалоговыеЛготы
		|ГДЕ
		|	НалоговыеЛготы.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	Иначе
		
		// Если временная таблица "ДвиженияЗапасыИзменение" существует и содержит записи
		// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
		// Текущее состояние набора и текущее состояние изменений помещаются во временную таблцу "ДвиженияЗапасыПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно первоначального.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияНалоговыеЛготыИзменение.НомерСтроки КАК НомерСтроки,
		|	ДвиженияНалоговыеЛготыИзменение.Организация КАК Организация,
		|	ДвиженияНалоговыеЛготыИзменение.Сотрудник КАК Сотрудник,
		|	ДвиженияНалоговыеЛготыИзменение.Подразделение КАК Подразделение,
		|	ДвиженияНалоговыеЛготыИзменение.ТипЛгот КАК ТипЛгот,
		|	ДвиженияНалоговыеЛготыИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью
		|ПОМЕСТИТЬ ДвиженияНалоговыеЛготыПередЗаписью
		|ИЗ
		|	ДвиженияНалоговыеЛготыИзменение КАК ДвиженияНалоговыеЛготыИзменение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НалоговыеЛготы.НомерСтроки,
		|	НалоговыеЛготы.Организация,
		|	НалоговыеЛготы.Сотрудник,
		|	НалоговыеЛготы.Подразделение КАК Подразделение,
		|	НалоговыеЛготы.ТипЛгот КАК ТипЛгот,
		|	ВЫБОР
		|		КОГДА НалоговыеЛготы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА НалоговыеЛготы.Сумма
		|		ИНАЧЕ -НалоговыеЛготы.Сумма
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.НалоговыеЛготы КАК НалоговыеЛготы
		|ГДЕ
		|	НалоговыеЛготы.Регистратор = &Регистратор
		|	И &Замещение");
		
		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);
				
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Временная таблица "ДвиженияЗапасыИзменение" уничтожается
	// Удаляется информация о ее существовании.
	
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияНалоговыеЛготыИзменение") Тогда
		
		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияНалоговыеЛготыИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияНалоговыеЛготыИзменение");
	
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияЗапасыИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияНалоговыеЛготыИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияНалоговыеЛготыИзменение.Организация КАК Организация,
	|	ДвиженияНалоговыеЛготыИзменение.Сотрудник КАК Сотрудник,
	|	ДвиженияНалоговыеЛготыИзменение.Подразделение КАК Подразделение,
	|	ДвиженияНалоговыеЛготыИзменение.ТипЛгот КАК ТипЛгот,
	|	СУММА(ДвиженияНалоговыеЛготыИзменение.СуммаПередЗаписью) КАК СуммаПередЗаписью,
	|	СУММА(ДвиженияНалоговыеЛготыИзменение.СуммаИзменение) КАК СуммаИзменение,
	|	СУММА(ДвиженияНалоговыеЛготыИзменение.СуммаПриЗаписи) КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияНалоговыеЛготыИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияНалоговыеЛготыПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияНалоговыеЛготыПередЗаписью.Организация КАК Организация,
	|		ДвиженияНалоговыеЛготыПередЗаписью.Сотрудник КАК Сотрудник,
	|		ДвиженияНалоговыеЛготыПередЗаписью.Подразделение КАК Подразделение,
	|		ДвиженияНалоговыеЛготыПередЗаписью.ТипЛгот КАК ТипЛгот,
	|		ДвиженияНалоговыеЛготыПередЗаписью.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|		ДвиженияНалоговыеЛготыПередЗаписью.СуммаПередЗаписью КАК СуммаИзменение,
	|		0 КАК СуммаПриЗаписи
	|	ИЗ
	|		ДвиженияНалоговыеЛготыПередЗаписью КАК ДвиженияНалоговыеЛготыПередЗаписью
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияНалоговыеЛготыПриЗаписи.НомерСтроки,
	|		ДвиженияНалоговыеЛготыПриЗаписи.Организация,
	|		ДвиженияНалоговыеЛготыПриЗаписи.Сотрудник,
	|		ДвиженияНалоговыеЛготыПриЗаписи.Подразделение,
	|		ДвиженияНалоговыеЛготыПриЗаписи.ТипЛгот,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияНалоговыеЛготыПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияНалоговыеЛготыПриЗаписи.Сумма
	|			ИНАЧЕ ДвиженияНалоговыеЛготыПриЗаписи.Сумма
	|		КОНЕЦ,
	|		ДвиженияНалоговыеЛготыПриЗаписи.Сумма
	|	ИЗ
	|		РегистрНакопления.НалоговыеЛготы КАК ДвиженияНалоговыеЛготыПриЗаписи
	|	ГДЕ
	|		ДвиженияНалоговыеЛготыПриЗаписи.Регистратор = &Регистратор) КАК ДвиженияНалоговыеЛготыИзменение
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияНалоговыеЛготыИзменение.Организация,
	|	ДвиженияНалоговыеЛготыИзменение.Сотрудник,
	|	ДвиженияНалоговыеЛготыИзменение.Подразделение,
	|	ДвиженияНалоговыеЛготыИзменение.ТипЛгот
	|
	|ИМЕЮЩИЕ
	|		СУММА(ДвиженияНалоговыеЛготыИзменение.СуммаИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Сотрудник,
	|	Подразделение,
	|	ТипЛгот");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияЗапасыИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияНалоговыеЛготыИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияЗапасыПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияНалоговыеЛготыПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
